#### Задание. Постройте топ фильмов в категориях Action и Comedy (или любых других).

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

from tqdm import tqdm_notebook

In [2]:
links = pd.read_csv('links.csv')
movies = pd.read_csv('movies.csv')
ratings = pd.read_csv('ratings.csv')
tags = pd.read_csv('tags.csv')

In [3]:
links.head(3)

   movieId  imdbId   tmdbId
0        1  114709    862.0
1        2  113497   8844.0
2        3  113228  15602.0

In [4]:
movies.head(3)

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance

In [5]:
ratings.head(3)

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224

In [6]:
tags.head(3)

   userId  movieId              tag   timestamp
0       2    60756            funny  1445714994
1       2    60756  Highly quotable  1445714996
2       2    60756     will ferrell  1445714992

In [7]:
# соединим таблицу с рейтингами и названиями фильмов
joined_ratings = ratings.join(movies.set_index('movieId'), on='movieId')

In [8]:
joined_ratings.head(3)

,userId,movieId,rating,timestamp,title,genres
0,1,1,4.0,964982703,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,1,3,4.0,964981247,Grumpier Old Men (1995),Comedy|Romance
2,1,6,4.0,964982224,Heat (1995),Action|Crime|Thriller

In [9]:
# Подсчитать топ в категории только Action

In [10]:
joined_ratings[joined_ratings['genres'] == 'Action'].groupby('title')[['rating']].mean() \
    .sort_values('rating', ascending=False)[:5]

                                                      rating
title
Knock Off (1998)                                    5.000000
Master of the Flying Guillotine (Du bi quan wan...  4.500000
Big Bird Cage, The (1972)                           4.500000
Game of Death (1978)                                4.166667
Crows Zero (Kurôzu zero) (2007)                     4.000000

In [11]:
# Подсчитать топ в категории Action совместно с другими категориями

In [12]:
joined_ratings[joined_ratings['genres'].apply(lambda x : 'Action' in x)].groupby('title')[['rating']].mean() \
    .sort_values('rating', ascending=False)[:10]

                                                    rating
title
Knock Off (1998)                                       5.0
On the Other Side of the Tracks (De l'autre côt...     5.0
Sonatine (Sonachine) (1993)                            5.0
Last Hurrah for Chivalry (Hao xia) (1979)              5.0
Shogun Assassin (1980)                                 5.0
Battle Royale 2: Requiem (Batoru rowaiaru II: C...     5.0
Wonder Woman (2009)                                    5.0
Priklyucheniya Kapitana Vrungelya (1979)               5.0
Tokyo Tribe (2014)                                     5.0
Love Exposure (Ai No Mukidashi) (2008)                 5.0

In [13]:
# Подсчитать топ в категории чисто Comedy

In [14]:
joined_ratings[joined_ratings['genres'] == 'Comedy'].groupby('title')[['rating']].mean() \
    .sort_values('rating', ascending=False)[:5]

                                            rating
title
Hollywood Shuffle (1987)                       5.0
Obsession (1965)                               5.0
Bill Hicks: Revelations (1993)                 5.0
George Carlin: Jammin' in New York (1992)      5.0
Dr. Goldfoot and the Bikini Machine (1965)     5.0

In [15]:
# Подсчитать топ в категории Comedy совместно с другими категориями

In [16]:
joined_ratings[joined_ratings['genres'].apply(lambda x : 'Comedy' in x)].groupby('title')[['rating']].mean() \
    .sort_values('rating', ascending=False)[:10]

                                              rating
title
George Carlin: Back in Town (1996)               5.0
Hollywood Chainsaw Hookers (1988)                5.0
Scooby-Doo! and the Loch Ness Monster (2004)     5.0
Scooby-Doo! and the Samurai Sword (2009)         5.0
What Men Talk About (2010)                       5.0
What Love Is (2007)                              5.0
Into the Woods (1991)                            5.0
What Happened Was... (1994)                      5.0
Seems Like Old Times (1980)                      5.0
Ice Age: The Great Egg-Scapade (2016)            5.0